Hi. When upgrading the aws provider to include this change, `aws_cloudfront_distribution`s are marked as requiring replacement. This isn't exactly a desirable impact as we've not made any change.

```
Terraform will perform the following actions:

  # module.flex.aws_cloudfront_distribution.frontend must be replaced
-/+ resource "aws_cloudfront_distribution" "frontend" {
      ~ arn                            = "..." -> (known after apply)
      ~ caller_reference               = "..." -> (known after apply)
      ~ domain_name                    = "....cloudfront.net" -> (known after apply)
      ~ etag                           = "..." -> (known after apply)
      ~ hosted_zone_id                 = "..." -> (known after apply)
      ~ id                             = "..." -> (known after apply)
      ~ in_progress_validation_batches = 0 -> (known after apply)
      ~ last_modified_time             = "2023-01-01 01:01:01.000 +0000 UTC" -> (known after apply)
      + staging                        = false # forces replacement
      ~ status                         = "Deployed" -> (known after apply)
      - tags                           = {} -> null
      ...
```

1. Is this expected behaviour (the `forces replacement` effect), given the default value is `false` (according to the [docs](https://registry.terraform.io/providers/hashicorp/aws/5.12.0/docs/resources/cloudfront_distribution#staging))?
2. Is there any way to avoid the replacement and just update the state?

Thanks.